@wgebis here you go:

```
❯ make testacc
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test $(go list ./... |grep -v 'vendor') -v  -timeout 120m -count=1
?       github.com/terraform-providers/terraform-provider-mailgun       [no test files]
=== RUN   TestAccMailgunDomainDataSource_Basic
2022/10/07 11:50:41 [DEBUG] resourceMailgunCredential()
2022/10/07 11:50:41 [DEBUG] resourceMailgunWebhook()
--- PASS: TestAccMailgunDomainDataSource_Basic (42.40s)
=== RUN   TestProvider
--- PASS: TestProvider (0.00s)
=== RUN   TestProvider_impl
--- PASS: TestProvider_impl (0.00s)
=== RUN   TestAccMailgunDomainCredential_Basic
--- PASS: TestAccMailgunDomainCredential_Basic (41.09s)
=== RUN   TestAccMailgunDomainCredential_Update
--- PASS: TestAccMailgunDomainCredential_Update (72.21s)
=== RUN   TestAccMailgunDomain_Basic
--- PASS: TestAccMailgunDomain_Basic (39.23s)
=== RUN   TestAccMailgunDomain_Import
--- PASS: TestAccMailgunDomain_Import (53.63s)
=== RUN   TestAccMailgunRoute_Basic
--- PASS: TestAccMailgunRoute_Basic (36.76s)
=== RUN   TestAccMailgunRoute_Import
--- PASS: TestAccMailgunRoute_Import (48.25s)
=== RUN   TestAccMailgunWebhook_Basic
--- PASS: TestAccMailgunWebhook_Basic (49.00s)
PASS
ok      github.com/terraform-providers/terraform-provider-mailgun/mailgun       382.590s
```

<details>
<summary>
I've also confirmed it worked using Route53
</summary>

```
❯ tfa
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - wgebis/mailgun in /c/Users/G-Rath/workspace/projects-oss/terraform-provider-mailgun
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"] will be created
  + resource "aws_route53_record" "mailgun_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.mailgun_records["email.my-domain-1234567891.com"] will be created
  + resource "aws_route53_record" "mailgun_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.mailgun_records["my-domain-1234567891.com"] will be created
  + resource "aws_route53_record" "mailgun_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.mine will be created
  + resource "aws_route53_zone" "mine" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "my-domain-1234567891.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # mailgun_domain.default will be created
  + resource "mailgun_domain" "default" {
      + id                = (known after apply)
      + name              = "my-domain-1234567891.com"
      + receiving_records = [
          + {
              + id          = "mxa.mailgun.org"
              + priority    = (known after apply)
              + record_type = (known after apply)
              + valid       = (known after apply)
              + value       = (known after apply)
            },
          + {
              + id          = "mxb.mailgun.org"
              + priority    = (known after apply)
              + record_type = (known after apply)
              + valid       = (known after apply)
              + value       = (known after apply)
            },
        ]
      + region            = "us"
      + sending_records   = [
          + {
              + id          = "_domainkey.my-domain-1234567891.com"
              + name        = (known after apply)
              + record_type = (known after apply)
              + valid       = (known after apply)
              + value       = (known after apply)
            },
          + {
              + id          = "email.my-domain-1234567891.com"
              + name        = (known after apply)
              + record_type = (known after apply)
              + valid       = (known after apply)
              + value       = (known after apply)
            },
          + {
              + id          = "my-domain-1234567891.com"
              + name        = (known after apply)
              + record_type = (known after apply)
              + valid       = (known after apply)
              + value       = (known after apply)
            },
        ]
      + smtp_login        = (known after apply)
      + smtp_password     = (known after apply)
      + spam_action       = "disabled"
      + wildcard          = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

mailgun_domain.default: Creating...
aws_route53_zone.mine: Creating...
mailgun_domain.default: Creation complete after 3s [id=my-domain-1234567891.com]
aws_route53_zone.mine: Still creating... [10s elapsed]
aws_route53_zone.mine: Still creating... [20s elapsed]
aws_route53_zone.mine: Still creating... [30s elapsed]
aws_route53_zone.mine: Still creating... [40s elapsed]
aws_route53_zone.mine: Still creating... [50s elapsed]
aws_route53_zone.mine: Creation complete after 53s [id=Z055174026N06MOMUYHWB]
aws_route53_record.mailgun_records["my-domain-1234567891.com"]: Creating...
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Creating...
aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]: Creating...
aws_route53_record.mailgun_records["my-domain-1234567891.com"]: Still creating... [10s elapsed]
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Still creating... [10s elapsed]
aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]: Still creating... [10s elapsed]
aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]: Still creating... [20s elapsed]
aws_route53_record.mailgun_records["my-domain-1234567891.com"]: Still creating... [20s elapsed]
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Still creating... [20s elapsed]
aws_route53_record.mailgun_records["my-domain-1234567891.com"]: Still creating... [30s elapsed]
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Still creating... [30s elapsed]
aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]: Still creating... [30s elapsed]
aws_route53_record.mailgun_records["my-domain-1234567891.com"]: Creation complete after 35s [id=Z055174026N06MOMUYHWB_my-domain-1234567891.com_TXT]
aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]: Creation complete after 35s [id=Z055174026N06MOMUYHWB_email.my-domain-1234567891.com_CNAME]
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Still creating... [40s elapsed]
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Creation complete after 43s [id=Z055174026N06MOMUYHWB_k1._domainkey.my-domain-1234567891.com_TXT]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

terraform-provider-mailgun/infra on  make-sending-records-predicable via 💠 default on ☁️  training (ap-southeast-2) took 1m43s
❯ tfa
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - wgebis/mailgun in /c/Users/G-Rath/workspace/projects-oss/terraform-provider-mailgun
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
mailgun_domain.default: Refreshing state... [id=my-domain-1234567891.com]
aws_route53_zone.mine: Refreshing state... [id=Z055174026N06MOMUYHWB]
aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]: Refreshing state... [id=Z055174026N06MOMUYHWB_email.my-domain-1234567891.com_CNAME]
aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]: Refreshing state... [id=Z055174026N06MOMUYHWB_k1._domainkey.my-domain-1234567891.com_TXT]
aws_route53_record.mailgun_records["my-domain-1234567891.com"]: Refreshing state... [id=Z055174026N06MOMUYHWB_my-domain-1234567891.com_TXT]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

terraform-provider-mailgun/infra on  make-sending-records-predicable via 💠 default on ☁️  training (ap-southeast-2) took 8s
❯
```
</details>